thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_prcm.h
/******************************************************************************
 *  Filename:       hw_prcm_h
 *  Revised:        2017-09-14 10:33:07 +0200 (Thu, 14 Sep 2017)
 *  Revision:       49733
 *
 * Copyright (c) 2015 - 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1) Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2) Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3) Neither the name of the ORGANIZATION nor the names of its contributors may
 *    be used to endorse or promote products derived from this software without
 *    specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************/

#ifndef __HW_PRCM_H__
#define __HW_PRCM_H__

//*****************************************************************************
//
// This section defines the register offsets of
// PRCM component
//
//*****************************************************************************
// Infrastructure Clock Division Factor For Run Mode
#define PRCM_O_INFRCLKDIVR 0x00000000

// Infrastructure Clock Division Factor For Sleep Mode
#define PRCM_O_INFRCLKDIVS 0x00000004

// Infrastructure Clock Division Factor For DeepSleep Mode
#define PRCM_O_INFRCLKDIVDS 0x00000008

// MCU Voltage Domain Control
#define PRCM_O_VDCTL 0x0000000C

// Load PRCM Settings To CLKCTRL Power Domain
#define PRCM_O_CLKLOADCTL 0x00000028

// RFC Clock Gate
#define PRCM_O_RFCCLKG 0x0000002C

// VIMS Clock Gate
#define PRCM_O_VIMSCLKG 0x00000030

// TRNG, CRYPTO And UDMA Clock Gate For Run Mode
#define PRCM_O_SECDMACLKGR 0x0000003C

// TRNG, CRYPTO And UDMA Clock Gate For Sleep Mode
#define PRCM_O_SECDMACLKGS 0x00000040

// TRNG, CRYPTO And UDMA Clock Gate For Deep Sleep Mode
#define PRCM_O_SECDMACLKGDS 0x00000044

// GPIO Clock Gate For Run Mode
#define PRCM_O_GPIOCLKGR 0x00000048

// GPIO Clock Gate For Sleep Mode
#define PRCM_O_GPIOCLKGS 0x0000004C

// GPIO Clock Gate For Deep Sleep Mode
#define PRCM_O_GPIOCLKGDS 0x00000050

// GPT Clock Gate For Run Mode
#define PRCM_O_GPTCLKGR 0x00000054

// GPT Clock Gate For Sleep Mode
#define PRCM_O_GPTCLKGS 0x00000058

// GPT Clock Gate For Deep Sleep Mode
#define PRCM_O_GPTCLKGDS 0x0000005C

// I2C Clock Gate For Run Mode
#define PRCM_O_I2CCLKGR 0x00000060

// I2C Clock Gate For Sleep Mode
#define PRCM_O_I2CCLKGS 0x00000064

// I2C Clock Gate For Deep Sleep Mode
#define PRCM_O_I2CCLKGDS 0x00000068

// UART Clock Gate For Run Mode
#define PRCM_O_UARTCLKGR 0x0000006C

// UART Clock Gate For Sleep Mode
#define PRCM_O_UARTCLKGS 0x00000070

// UART Clock Gate For Deep Sleep Mode
#define PRCM_O_UARTCLKGDS 0x00000074

// SSI Clock Gate For Run Mode
#define PRCM_O_SSICLKGR 0x00000078

// SSI Clock Gate For Sleep Mode
#define PRCM_O_SSICLKGS 0x0000007C

// SSI Clock Gate For Deep Sleep Mode
#define PRCM_O_SSICLKGDS 0x00000080

// I2S Clock Gate For Run Mode
#define PRCM_O_I2SCLKGR 0x00000084

// I2S Clock Gate For Sleep Mode
#define PRCM_O_I2SCLKGS 0x00000088

// I2S Clock Gate For Deep Sleep Mode
#define PRCM_O_I2SCLKGDS 0x0000008C

// Internal
#define PRCM_O_CPUCLKDIV 0x000000B8

// I2S Clock Control
#define PRCM_O_I2SBCLKSEL 0x000000C8

// GPT Scalar
#define PRCM_O_GPTCLKDIV 0x000000CC

// I2S Clock Control
#define PRCM_O_I2SCLKCTL 0x000000D0

// MCLK Division Ratio
#define PRCM_O_I2SMCLKDIV 0x000000D4

// BCLK Division Ratio
#define PRCM_O_I2SBCLKDIV 0x000000D8

// WCLK Division Ratio
#define PRCM_O_I2SWCLKDIV 0x000000DC

// SW Initiated Resets
#define PRCM_O_SWRESET 0x0000010C

// WARM Reset Control And Status
#define PRCM_O_WARMRESET 0x00000110

// Power Domain Control
#define PRCM_O_PDCTL0 0x0000012C

// RFC Power Domain Control
#define PRCM_O_PDCTL0RFC 0x00000130

// SERIAL Power Domain Control
#define PRCM_O_PDCTL0SERIAL 0x00000134

// PERIPH Power Domain Control
#define PRCM_O_PDCTL0PERIPH 0x00000138

// Power Domain Status
#define PRCM_O_PDSTAT0 0x00000140

// RFC Power Domain Status
#define PRCM_O_PDSTAT0RFC 0x00000144

// SERIAL Power Domain Status
#define PRCM_O_PDSTAT0SERIAL 0x00000148

// PERIPH Power Domain Status
#define PRCM_O_PDSTAT0PERIPH 0x0000014C

// Power Domain Control
#define PRCM_O_PDCTL1 0x0000017C

// CPU Power Domain Direct Control
#define PRCM_O_PDCTL1CPU 0x00000184

// RFC Power Domain Direct Control
#define PRCM_O_PDCTL1RFC 0x00000188

// VIMS Mode Direct Control
#define PRCM_O_PDCTL1VIMS 0x0000018C

// Power Manager Status
#define PRCM_O_PDSTAT1 0x00000194

// BUS Power Domain Direct Read Status
#define PRCM_O_PDSTAT1BUS 0x00000198

// RFC Power Domain Direct Read Status
#define PRCM_O_PDSTAT1RFC 0x0000019C

// CPU Power Domain Direct Read Status
#define PRCM_O_PDSTAT1CPU 0x000001A0

