thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_prcm.h
// VIMS Mode Direct Read Status
#define PRCM_O_PDSTAT1VIMS 0x000001A4

// Control To RFC
#define PRCM_O_RFCBITS 0x000001CC

// Selected RFC Mode
#define PRCM_O_RFCMODESEL 0x000001D0

// Allowed RFC Modes
#define PRCM_O_RFCMODEHWOPT 0x000001D4

// Power Profiler Register
#define PRCM_O_PWRPROFSTAT 0x000001E0

// Memory Retention Control
#define PRCM_O_RAMRETEN 0x00000224

//*****************************************************************************
//
// Register: PRCM_O_INFRCLKDIVR
//
//*****************************************************************************
// Field:   [1:0] RATIO
//
// Division rate for clocks driving modules in the MCU_AON domain when system
// CPU is in run mode. Division ratio affects both infrastructure clock and
// perbusull clock.
// ENUMs:
// DIV32                    Divide by 32
// DIV8                     Divide by 8
// DIV2                     Divide by 2
// DIV1                     Divide by 1
#define PRCM_INFRCLKDIVR_RATIO_W 2
#define PRCM_INFRCLKDIVR_RATIO_M 0x00000003
#define PRCM_INFRCLKDIVR_RATIO_S 0
#define PRCM_INFRCLKDIVR_RATIO_DIV32 0x00000003
#define PRCM_INFRCLKDIVR_RATIO_DIV8 0x00000002
#define PRCM_INFRCLKDIVR_RATIO_DIV2 0x00000001
#define PRCM_INFRCLKDIVR_RATIO_DIV1 0x00000000

//*****************************************************************************
//
// Register: PRCM_O_INFRCLKDIVS
//
//*****************************************************************************
// Field:   [1:0] RATIO
//
// Division rate for clocks driving modules in the MCU_AON domain when system
// CPU is in sleep mode. Division ratio affects both infrastructure clock and
// perbusull clock.
// ENUMs:
// DIV32                    Divide by 32
// DIV8                     Divide by 8
// DIV2                     Divide by 2
// DIV1                     Divide by 1
#define PRCM_INFRCLKDIVS_RATIO_W 2
#define PRCM_INFRCLKDIVS_RATIO_M 0x00000003
#define PRCM_INFRCLKDIVS_RATIO_S 0
#define PRCM_INFRCLKDIVS_RATIO_DIV32 0x00000003
#define PRCM_INFRCLKDIVS_RATIO_DIV8 0x00000002
#define PRCM_INFRCLKDIVS_RATIO_DIV2 0x00000001
#define PRCM_INFRCLKDIVS_RATIO_DIV1 0x00000000

//*****************************************************************************
//
// Register: PRCM_O_INFRCLKDIVDS
//
//*****************************************************************************
// Field:   [1:0] RATIO
//
// Division rate for clocks driving modules in the MCU_AON domain when system
// CPU is in seepsleep mode. Division ratio affects both infrastructure clock
// and perbusull clock.
// ENUMs:
// DIV32                    Divide by 32
// DIV8                     Divide by 8
// DIV2                     Divide by 2
// DIV1                     Divide by 1
#define PRCM_INFRCLKDIVDS_RATIO_W 2
#define PRCM_INFRCLKDIVDS_RATIO_M 0x00000003
#define PRCM_INFRCLKDIVDS_RATIO_S 0
#define PRCM_INFRCLKDIVDS_RATIO_DIV32 0x00000003
#define PRCM_INFRCLKDIVDS_RATIO_DIV8 0x00000002
#define PRCM_INFRCLKDIVDS_RATIO_DIV2 0x00000001
#define PRCM_INFRCLKDIVDS_RATIO_DIV1 0x00000000

//*****************************************************************************
//
// Register: PRCM_O_VDCTL
//
//*****************************************************************************
// Field:     [2] MCU_VD
//
// Request WUC to power down the MCU voltage domain
//
// 0: No request
// 1: Assert request when possible. An asserted power down request will result
// in a boot of the MCU system when powered up again.
//
// The bit will have no effect before the following requirements are met:
// 1. PDCTL1.CPU_ON = 0
// 2. PDCTL1.VIMS_MODE = 0
// 3. SECDMACLKGDS.DMA_CLK_EN = 0 (Note: Setting must be loaded with
// CLKLOADCTL.LOAD)
// 4. SECDMACLKGDS.CRYPTO_CLK_EN = 0 (Note: Setting must be loaded with
// CLKLOADCTL.LOAD)
// 5. RFC do no request access to BUS
// 6. System CPU in deepsleep
#define PRCM_VDCTL_MCU_VD 0x00000004
#define PRCM_VDCTL_MCU_VD_BITN 2
#define PRCM_VDCTL_MCU_VD_M 0x00000004
#define PRCM_VDCTL_MCU_VD_S 2

// Field:     [0] ULDO
//
// Request WUC to switch to uLDO.
//
// 0: No request
// 1: Assert request when possible
//
// The bit will have no effect before the following requirements are met:
// 1. PDCTL1.CPU_ON = 0
// 2. PDCTL1.VIMS_MODE = 0
// 3. SECDMACLKGDS.DMA_CLK_EN = 0 (Note: Setting must be loaded with
// CLKLOADCTL.LOAD)
// 4. SECDMACLKGDS.CRYPTO_CLK_EN = 0 (Note: Setting must be loaded with
// CLKLOADCTL.LOAD)
// 5. RFC do no request access to BUS
// 6. System CPU in deepsleep
#define PRCM_VDCTL_ULDO 0x00000001
#define PRCM_VDCTL_ULDO_BITN 0
#define PRCM_VDCTL_ULDO_M 0x00000001
#define PRCM_VDCTL_ULDO_S 0

//*****************************************************************************
//
// Register: PRCM_O_CLKLOADCTL
//
//*****************************************************************************
// Field:     [1] LOAD_DONE
//
// Status of LOAD.
// Will be cleared to 0 when any of the registers requiring a LOAD is written
// to, and be set to 1 when a LOAD is done.
// Note that writing no change to a register will result in the LOAD_DONE being
// cleared.
//
// 0 : One or more registers have been write accessed after last LOAD
// 1 : No registers are write accessed after last LOAD
#define PRCM_CLKLOADCTL_LOAD_DONE 0x00000002
#define PRCM_CLKLOADCTL_LOAD_DONE_BITN 1
#define PRCM_CLKLOADCTL_LOAD_DONE_M 0x00000002
#define PRCM_CLKLOADCTL_LOAD_DONE_S 1

// Field:     [0] LOAD
//
// 0: No action
// 1: Load settings to CLKCTRL. Bit is HW cleared.
//
// Multiple changes to settings may be done before LOAD is written once so all
// changes takes place at the same time. LOAD can also be done after single
// setting updates.
//
// Registers that needs to be followed by LOAD before settings being applied
// are:
// - RFCCLKG
// - VIMSCLKG
// - SECDMACLKGR
// - SECDMACLKGS
// - SECDMACLKGDS
// - GPIOCLKGR
// - GPIOCLKGS
// - GPIOCLKGDS
// - GPTCLKGR
// - GPTCLKGS
// - GPTCLKGDS
// - GPTCLKDIV
// - I2CCLKGR
// - I2CCLKGS
// - I2CCLKGDS
// - SSICLKGR
// - SSICLKGS
// - SSICLKGDS
// - UARTCLKGR
// - UARTCLKGS
// - UARTCLKGDS
// - I2SCLKGR
// - I2SCLKGS
// - I2SCLKGDS
// - I2SBCLKSEL
// - I2SCLKCTL
// - I2SMCLKDIV
// - I2SBCLKDIV
// - I2SWCLKDIV
#define PRCM_CLKLOADCTL_LOAD 0x00000001
#define PRCM_CLKLOADCTL_LOAD_BITN 0
#define PRCM_CLKLOADCTL_LOAD_M 0x00000001
#define PRCM_CLKLOADCTL_LOAD_S 0

//*****************************************************************************
//
// Register: PRCM_O_RFCCLKG
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock if RFC power domain is on
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_RFCCLKG_CLK_EN 0x00000001
#define PRCM_RFCCLKG_CLK_EN_BITN 0
#define PRCM_RFCCLKG_CLK_EN_M 0x00000001
#define PRCM_RFCCLKG_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_VIMSCLKG
//
//*****************************************************************************
// Field:   [1:0] CLK_EN
//
//
// 00: Disable clock
// 01: Disable clock when system CPU is in DeepSleep
// 11: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_VIMSCLKG_CLK_EN_W 2
#define PRCM_VIMSCLKG_CLK_EN_M 0x00000003
#define PRCM_VIMSCLKG_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_SECDMACLKGR
//
//*****************************************************************************
// Field:     [8] DMA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_DMA_CLK_EN 0x00000100
#define PRCM_SECDMACLKGR_DMA_CLK_EN_BITN 8
#define PRCM_SECDMACLKGR_DMA_CLK_EN_M 0x00000100
#define PRCM_SECDMACLKGR_DMA_CLK_EN_S 8

// Field:     [1] TRNG_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_TRNG_CLK_EN 0x00000002
#define PRCM_SECDMACLKGR_TRNG_CLK_EN_BITN 1
#define PRCM_SECDMACLKGR_TRNG_CLK_EN_M 0x00000002
#define PRCM_SECDMACLKGR_TRNG_CLK_EN_S 1

// Field:     [0] CRYPTO_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGR_CRYPTO_CLK_EN 0x00000001
#define PRCM_SECDMACLKGR_CRYPTO_CLK_EN_BITN 0
#define PRCM_SECDMACLKGR_CRYPTO_CLK_EN_M 0x00000001
#define PRCM_SECDMACLKGR_CRYPTO_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_SECDMACLKGS
//
//*****************************************************************************
// Field:     [8] DMA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGS_DMA_CLK_EN 0x00000100
#define PRCM_SECDMACLKGS_DMA_CLK_EN_BITN 8
#define PRCM_SECDMACLKGS_DMA_CLK_EN_M 0x00000100
#define PRCM_SECDMACLKGS_DMA_CLK_EN_S 8

// Field:     [1] TRNG_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGS_TRNG_CLK_EN 0x00000002
#define PRCM_SECDMACLKGS_TRNG_CLK_EN_BITN 1
#define PRCM_SECDMACLKGS_TRNG_CLK_EN_M 0x00000002
#define PRCM_SECDMACLKGS_TRNG_CLK_EN_S 1

// Field:     [0] CRYPTO_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGS_CRYPTO_CLK_EN 0x00000001
#define PRCM_SECDMACLKGS_CRYPTO_CLK_EN_BITN 0
#define PRCM_SECDMACLKGS_CRYPTO_CLK_EN_M 0x00000001
#define PRCM_SECDMACLKGS_CRYPTO_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_SECDMACLKGDS
//
//*****************************************************************************
// Field:     [8] DMA_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGDS_DMA_CLK_EN 0x00000100
#define PRCM_SECDMACLKGDS_DMA_CLK_EN_BITN 8
#define PRCM_SECDMACLKGDS_DMA_CLK_EN_M 0x00000100
#define PRCM_SECDMACLKGDS_DMA_CLK_EN_S 8

// Field:     [1] TRNG_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGDS_TRNG_CLK_EN 0x00000002
#define PRCM_SECDMACLKGDS_TRNG_CLK_EN_BITN 1
#define PRCM_SECDMACLKGDS_TRNG_CLK_EN_M 0x00000002
#define PRCM_SECDMACLKGDS_TRNG_CLK_EN_S 1

// Field:     [0] CRYPTO_CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_SECDMACLKGDS_CRYPTO_CLK_EN 0x00000001
#define PRCM_SECDMACLKGDS_CRYPTO_CLK_EN_BITN 0
#define PRCM_SECDMACLKGDS_CRYPTO_CLK_EN_M 0x00000001
#define PRCM_SECDMACLKGDS_CRYPTO_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_GPIOCLKGR
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_GPIOCLKGR_CLK_EN 0x00000001
#define PRCM_GPIOCLKGR_CLK_EN_BITN 0
#define PRCM_GPIOCLKGR_CLK_EN_M 0x00000001
#define PRCM_GPIOCLKGR_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_GPIOCLKGS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_GPIOCLKGS_CLK_EN 0x00000001
#define PRCM_GPIOCLKGS_CLK_EN_BITN 0
#define PRCM_GPIOCLKGS_CLK_EN_M 0x00000001
#define PRCM_GPIOCLKGS_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_GPIOCLKGDS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_GPIOCLKGDS_CLK_EN 0x00000001
#define PRCM_GPIOCLKGDS_CLK_EN_BITN 0
#define PRCM_GPIOCLKGDS_CLK_EN_M 0x00000001
#define PRCM_GPIOCLKGDS_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_GPTCLKGR
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
// Each bit below has the following meaning:
//
// 0: Disable clock
// 1: Enable clock
//
// ENUMs can be combined
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// GPT3                     Enable clock for GPT3
// GPT2                     Enable clock for GPT2
// GPT1                     Enable clock for GPT1
// GPT0                     Enable clock for GPT0
#define PRCM_GPTCLKGR_CLK_EN_W 4
#define PRCM_GPTCLKGR_CLK_EN_M 0x0000000F
#define PRCM_GPTCLKGR_CLK_EN_S 0
#define PRCM_GPTCLKGR_CLK_EN_GPT3 0x00000008
#define PRCM_GPTCLKGR_CLK_EN_GPT2 0x00000004
#define PRCM_GPTCLKGR_CLK_EN_GPT1 0x00000002
#define PRCM_GPTCLKGR_CLK_EN_GPT0 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_GPTCLKGS
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
// Each bit below has the following meaning:
//
// 0: Disable clock
// 1: Enable clock
//
// ENUMs can be combined
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// GPT3                     Enable clock for GPT3
// GPT2                     Enable clock for GPT2
// GPT1                     Enable clock for GPT1
// GPT0                     Enable clock for GPT0
#define PRCM_GPTCLKGS_CLK_EN_W 4
#define PRCM_GPTCLKGS_CLK_EN_M 0x0000000F
#define PRCM_GPTCLKGS_CLK_EN_S 0
#define PRCM_GPTCLKGS_CLK_EN_GPT3 0x00000008
#define PRCM_GPTCLKGS_CLK_EN_GPT2 0x00000004
#define PRCM_GPTCLKGS_CLK_EN_GPT1 0x00000002
#define PRCM_GPTCLKGS_CLK_EN_GPT0 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_GPTCLKGDS
//
//*****************************************************************************
// Field:   [3:0] CLK_EN
//
// Each bit below has the following meaning:
//
// 0: Disable clock
// 1: Enable clock
//
// ENUMs can be combined
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// GPT3                     Enable clock for GPT3
// GPT2                     Enable clock for GPT2
// GPT1                     Enable clock for GPT1
// GPT0                     Enable clock for GPT0
#define PRCM_GPTCLKGDS_CLK_EN_W 4
#define PRCM_GPTCLKGDS_CLK_EN_M 0x0000000F
#define PRCM_GPTCLKGDS_CLK_EN_S 0
#define PRCM_GPTCLKGDS_CLK_EN_GPT3 0x00000008
#define PRCM_GPTCLKGDS_CLK_EN_GPT2 0x00000004
#define PRCM_GPTCLKGDS_CLK_EN_GPT1 0x00000002
#define PRCM_GPTCLKGDS_CLK_EN_GPT0 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_I2CCLKGR
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2CCLKGR_CLK_EN 0x00000001
#define PRCM_I2CCLKGR_CLK_EN_BITN 0
#define PRCM_I2CCLKGR_CLK_EN_M 0x00000001
#define PRCM_I2CCLKGR_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_I2CCLKGS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2CCLKGS_CLK_EN 0x00000001
#define PRCM_I2CCLKGS_CLK_EN_BITN 0
#define PRCM_I2CCLKGS_CLK_EN_M 0x00000001
#define PRCM_I2CCLKGS_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_I2CCLKGDS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2CCLKGDS_CLK_EN 0x00000001
#define PRCM_I2CCLKGDS_CLK_EN_BITN 0
#define PRCM_I2CCLKGDS_CLK_EN_M 0x00000001
#define PRCM_I2CCLKGDS_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_UARTCLKGR
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_UARTCLKGR_CLK_EN 0x00000001
#define PRCM_UARTCLKGR_CLK_EN_BITN 0
#define PRCM_UARTCLKGR_CLK_EN_M 0x00000001
#define PRCM_UARTCLKGR_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_UARTCLKGS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_UARTCLKGS_CLK_EN 0x00000001
#define PRCM_UARTCLKGS_CLK_EN_BITN 0
#define PRCM_UARTCLKGS_CLK_EN_M 0x00000001
#define PRCM_UARTCLKGS_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_UARTCLKGDS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_UARTCLKGDS_CLK_EN 0x00000001
#define PRCM_UARTCLKGDS_CLK_EN_BITN 0
#define PRCM_UARTCLKGDS_CLK_EN_M 0x00000001
#define PRCM_UARTCLKGDS_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_SSICLKGR
//
//*****************************************************************************
// Field:   [1:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// SSI1                     Enable clock for SSI1
// SSI0                     Enable clock for SSI0
#define PRCM_SSICLKGR_CLK_EN_W 2
#define PRCM_SSICLKGR_CLK_EN_M 0x00000003
#define PRCM_SSICLKGR_CLK_EN_S 0
#define PRCM_SSICLKGR_CLK_EN_SSI1 0x00000002
#define PRCM_SSICLKGR_CLK_EN_SSI0 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_SSICLKGS
//
//*****************************************************************************
// Field:   [1:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// SSI1                     Enable clock for SSI1
// SSI0                     Enable clock for SSI0
#define PRCM_SSICLKGS_CLK_EN_W 2
#define PRCM_SSICLKGS_CLK_EN_M 0x00000003
#define PRCM_SSICLKGS_CLK_EN_S 0
#define PRCM_SSICLKGS_CLK_EN_SSI1 0x00000002
#define PRCM_SSICLKGS_CLK_EN_SSI0 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_SSICLKGDS
//
//*****************************************************************************
// Field:   [1:0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// SSI1                     Enable clock for SSI1
// SSI0                     Enable clock for SSI0
#define PRCM_SSICLKGDS_CLK_EN_W 2
#define PRCM_SSICLKGDS_CLK_EN_M 0x00000003
#define PRCM_SSICLKGDS_CLK_EN_S 0
#define PRCM_SSICLKGDS_CLK_EN_SSI1 0x00000002
#define PRCM_SSICLKGDS_CLK_EN_SSI0 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKGR
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKGR_CLK_EN 0x00000001
#define PRCM_I2SCLKGR_CLK_EN_BITN 0
#define PRCM_I2SCLKGR_CLK_EN_M 0x00000001
#define PRCM_I2SCLKGR_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKGS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKGS_CLK_EN 0x00000001
#define PRCM_I2SCLKGS_CLK_EN_BITN 0
#define PRCM_I2SCLKGS_CLK_EN_M 0x00000001
#define PRCM_I2SCLKGS_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKGDS
//
//*****************************************************************************
// Field:     [0] CLK_EN
//
//
// 0: Disable clock
// 1: Enable clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKGDS_CLK_EN 0x00000001
#define PRCM_I2SCLKGDS_CLK_EN_BITN 0
#define PRCM_I2SCLKGDS_CLK_EN_M 0x00000001
#define PRCM_I2SCLKGDS_CLK_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_CPUCLKDIV
//
//*****************************************************************************
// Field:     [0] RATIO
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIV2                     Internal. Only to be used through TI provided API.
// DIV1                     Internal. Only to be used through TI provided API.
#define PRCM_CPUCLKDIV_RATIO 0x00000001
#define PRCM_CPUCLKDIV_RATIO_BITN 0
#define PRCM_CPUCLKDIV_RATIO_M 0x00000001
#define PRCM_CPUCLKDIV_RATIO_S 0
#define PRCM_CPUCLKDIV_RATIO_DIV2 0x00000001
#define PRCM_CPUCLKDIV_RATIO_DIV1 0x00000000

//*****************************************************************************
//
// Register: PRCM_O_I2SBCLKSEL
//
//*****************************************************************************
// Field:     [0] SRC
//
// BCLK source selector
//
// 0: Use external BCLK
// 1: Use internally generated clock
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SBCLKSEL_SRC 0x00000001
#define PRCM_I2SBCLKSEL_SRC_BITN 0
#define PRCM_I2SBCLKSEL_SRC_M 0x00000001
#define PRCM_I2SBCLKSEL_SRC_S 0

