thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_prcm.h
//*****************************************************************************
//
// Register: PRCM_O_GPTCLKDIV
//
//*****************************************************************************
// Field:   [3:0] RATIO
//
// Scalar used for GPTs. The division rate will be constant and ungated for Run
// / Sleep / DeepSleep mode.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// Other values are not supported.
// ENUMs:
// DIV256                   Divide by 256
// DIV128                   Divide by 128
// DIV64                    Divide by 64
// DIV32                    Divide by 32
// DIV16                    Divide by 16
// DIV8                     Divide by 8
// DIV4                     Divide by 4
// DIV2                     Divide by 2
// DIV1                     Divide by 1
#define PRCM_GPTCLKDIV_RATIO_W 4
#define PRCM_GPTCLKDIV_RATIO_M 0x0000000F
#define PRCM_GPTCLKDIV_RATIO_S 0
#define PRCM_GPTCLKDIV_RATIO_DIV256 0x00000008
#define PRCM_GPTCLKDIV_RATIO_DIV128 0x00000007
#define PRCM_GPTCLKDIV_RATIO_DIV64 0x00000006
#define PRCM_GPTCLKDIV_RATIO_DIV32 0x00000005
#define PRCM_GPTCLKDIV_RATIO_DIV16 0x00000004
#define PRCM_GPTCLKDIV_RATIO_DIV8 0x00000003
#define PRCM_GPTCLKDIV_RATIO_DIV4 0x00000002
#define PRCM_GPTCLKDIV_RATIO_DIV2 0x00000001
#define PRCM_GPTCLKDIV_RATIO_DIV1 0x00000000

//*****************************************************************************
//
// Register: PRCM_O_I2SCLKCTL
//
//*****************************************************************************
// Field:     [3] SMPL_ON_POSEDGE
//
// On the I2S serial interface, data and WCLK is sampled and clocked out on
// opposite edges of BCLK.
//
// 0 - data and WCLK are sampled on the negative edge and clocked out on the
// positive edge.
// 1 - data and WCLK are sampled on the positive edge and clocked out on the
// negative edge.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE 0x00000008
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_BITN 3
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_M 0x00000008
#define PRCM_I2SCLKCTL_SMPL_ON_POSEDGE_S 3

// Field:   [2:1] WCLK_PHASE
//
// Decides how the WCLK division ratio is calculated and used to generate
// different duty cycles (See I2SWCLKDIV.WDIV).
//
// 0: Single phase
// 1: Dual phase
// 2: User Defined
// 3: Reserved/Undefined
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKCTL_WCLK_PHASE_W 2
#define PRCM_I2SCLKCTL_WCLK_PHASE_M 0x00000006
#define PRCM_I2SCLKCTL_WCLK_PHASE_S 1

// Field:     [0] EN
//
//
// 0: MCLK, BCLK and WCLK will be static low
// 1: Enables the generation of  MCLK, BCLK and WCLK
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SCLKCTL_EN 0x00000001
#define PRCM_I2SCLKCTL_EN_BITN 0
#define PRCM_I2SCLKCTL_EN_M 0x00000001
#define PRCM_I2SCLKCTL_EN_S 0

//*****************************************************************************
//
// Register: PRCM_O_I2SMCLKDIV
//
//*****************************************************************************
// Field:   [9:0] MDIV
//
// An unsigned factor of the division ratio used to generate MCLK [2-1024]:
//
// MCLK = MCUCLK/MDIV[Hz]
// MCUCLK is 48MHz in normal mode. For powerdown mode the frequency is defined
// by AON_WUC:MCUCLK.PWR_DWN_SRC
//
// A value of 0 is interpreted as 1024.
// A value of 1 is invalid.
// If MDIV is odd the low phase of the clock is one MCUCLK period longer than
// the high phase.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SMCLKDIV_MDIV_W 10
#define PRCM_I2SMCLKDIV_MDIV_M 0x000003FF
#define PRCM_I2SMCLKDIV_MDIV_S 0

//*****************************************************************************
//
// Register: PRCM_O_I2SBCLKDIV
//
//*****************************************************************************
// Field:   [9:0] BDIV
//
// An unsigned factor of the division ratio used to generate I2S BCLK [2-1024]:
//
// BCLK = MCUCLK/BDIV[Hz]
// MCUCLK is 48MHz in normal mode. For powerdown mode the frequency is defined
// by AON_WUC:MCUCLK.PWR_DWN_SRC
//
// A value of 0 is interpreted as 1024.
// A value of 1 is invalid.
// If BDIV is odd and I2SCLKCTL.SMPL_ON_POSEDGE = 0, the low phase of the clock
// is one MCUCLK period longer than the high phase.
// If BDIV is odd and I2SCLKCTL.SMPL_ON_POSEDGE = 1 , the high phase of the
// clock is one MCUCLK period longer than the low phase.
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SBCLKDIV_BDIV_W 10
#define PRCM_I2SBCLKDIV_BDIV_M 0x000003FF
#define PRCM_I2SBCLKDIV_BDIV_S 0

//*****************************************************************************
//
// Register: PRCM_O_I2SWCLKDIV
//
//*****************************************************************************
// Field:  [15:0] WDIV
//
// If I2SCLKCTL.WCLK_PHASE = 0, Single phase.
// WCLK is high one BCLK period and low WDIV[9:0] (unsigned, [1-1023]) BCLK
// periods.
//
// WCLK = MCUCLK / BDIV*(WDIV[9:0] + 1) [Hz]
// MCUCLK is 48MHz in normal mode. For powerdown mode the frequency is defined
// by AON_WUC:MCUCLK.PWR_DWN_SRC
//
// If I2SCLKCTL.WCLK_PHASE = 1, Dual phase.
// Each phase on WCLK (50% duty cycle) is WDIV[9:0] (unsigned, [1-1023]) BCLK
// periods.
//
// WCLK = MCUCLK / BDIV*(2*WDIV[9:0]) [Hz]
//
// If I2SCLKCTL.WCLK_PHASE = 2, User defined.
// WCLK is high WDIV[7:0] (unsigned, [1-255]) BCLK periods and low WDIV[15:8]
// (unsigned, [1-255]) BCLK periods.
//
// WCLK = MCUCLK / (BDIV*(WDIV[7:0] + WDIV[15:8]) [Hz]
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
#define PRCM_I2SWCLKDIV_WDIV_W 16
#define PRCM_I2SWCLKDIV_WDIV_M 0x0000FFFF
#define PRCM_I2SWCLKDIV_WDIV_S 0

//*****************************************************************************
//
// Register: PRCM_O_SWRESET
//
//*****************************************************************************
// Field:     [2] MCU
//
// Internal. Only to be used through TI provided API.
#define PRCM_SWRESET_MCU 0x00000004
#define PRCM_SWRESET_MCU_BITN 2
#define PRCM_SWRESET_MCU_M 0x00000004
#define PRCM_SWRESET_MCU_S 2

//*****************************************************************************
//
// Register: PRCM_O_WARMRESET
//
//*****************************************************************************
// Field:     [2] WR_TO_PINRESET
//
// 0: No action
// 1: A warm system reset event triggered by the below listed sources will
// result in an emulated pin reset.
//
// Warm reset sources included:
// ICEPick sysreset
// System CPU reset request, CPU_SCS:AIRCR.SYSRESETREQ
// System CPU Lockup
// WDT timeout
//
// An active ICEPick block system reset will gate all sources except ICEPick
// sysreset
//
// SW can read AON_SYSCTL:RESETCTL.RESET_SRC to find the source of the last
// reset resulting in a full power up sequence. WARMRESET in this register is
// set in the scenario that WR_TO_PINRESET=1 and one of the above listed
// sources is triggered.
#define PRCM_WARMRESET_WR_TO_PINRESET 0x00000004
#define PRCM_WARMRESET_WR_TO_PINRESET_BITN 2
#define PRCM_WARMRESET_WR_TO_PINRESET_M 0x00000004
#define PRCM_WARMRESET_WR_TO_PINRESET_S 2

// Field:     [1] LOCKUP_STAT
//
//
// 0: No registred event
// 1: A system CPU LOCKUP event has occured since last SW clear of the
// register.
//
// A read of this register clears both  WDT_STAT and LOCKUP_STAT.
#define PRCM_WARMRESET_LOCKUP_STAT 0x00000002
#define PRCM_WARMRESET_LOCKUP_STAT_BITN 1
#define PRCM_WARMRESET_LOCKUP_STAT_M 0x00000002
#define PRCM_WARMRESET_LOCKUP_STAT_S 1

// Field:     [0] WDT_STAT
//
//
// 0: No registered event
// 1: A WDT event has occured since last SW clear of the register.
//
// A read of this register clears both WDT_STAT and LOCKUP_STAT.
#define PRCM_WARMRESET_WDT_STAT 0x00000001
#define PRCM_WARMRESET_WDT_STAT_BITN 0
#define PRCM_WARMRESET_WDT_STAT_M 0x00000001
#define PRCM_WARMRESET_WDT_STAT_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDCTL0
//
//*****************************************************************************
// Field:     [2] PERIPH_ON
//
// PERIPH Power domain.
//
// 0: PERIPH power domain is powered down
// 1: PERIPH power domain is powered up
#define PRCM_PDCTL0_PERIPH_ON 0x00000004
#define PRCM_PDCTL0_PERIPH_ON_BITN 2
#define PRCM_PDCTL0_PERIPH_ON_M 0x00000004
#define PRCM_PDCTL0_PERIPH_ON_S 2

