thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_prcm.h
// Field:     [1] SERIAL_ON
//
// SERIAL Power domain.
//
// 0: SERIAL power domain is powered down
// 1: SERIAL power domain is powered up
#define PRCM_PDCTL0_SERIAL_ON 0x00000002
#define PRCM_PDCTL0_SERIAL_ON_BITN 1
#define PRCM_PDCTL0_SERIAL_ON_M 0x00000002
#define PRCM_PDCTL0_SERIAL_ON_S 1

// Field:     [0] RFC_ON
//
//
// 0: RFC power domain powered off if also PDCTL1.RFC_ON = 0
// 1: RFC power domain powered on
#define PRCM_PDCTL0_RFC_ON 0x00000001
#define PRCM_PDCTL0_RFC_ON_BITN 0
#define PRCM_PDCTL0_RFC_ON_M 0x00000001
#define PRCM_PDCTL0_RFC_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDCTL0RFC
//
//*****************************************************************************
// Field:     [0] ON
//
// Alias for PDCTL0.RFC_ON
#define PRCM_PDCTL0RFC_ON 0x00000001
#define PRCM_PDCTL0RFC_ON_BITN 0
#define PRCM_PDCTL0RFC_ON_M 0x00000001
#define PRCM_PDCTL0RFC_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDCTL0SERIAL
//
//*****************************************************************************
// Field:     [0] ON
//
// Alias for PDCTL0.SERIAL_ON
#define PRCM_PDCTL0SERIAL_ON 0x00000001
#define PRCM_PDCTL0SERIAL_ON_BITN 0
#define PRCM_PDCTL0SERIAL_ON_M 0x00000001
#define PRCM_PDCTL0SERIAL_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDCTL0PERIPH
//
//*****************************************************************************
// Field:     [0] ON
//
// Alias for PDCTL0.PERIPH_ON
#define PRCM_PDCTL0PERIPH_ON 0x00000001
#define PRCM_PDCTL0PERIPH_ON_BITN 0
#define PRCM_PDCTL0PERIPH_ON_M 0x00000001
#define PRCM_PDCTL0PERIPH_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT0
//
//*****************************************************************************
// Field:     [2] PERIPH_ON
//
// PERIPH Power domain.
//
// 0: Domain may be powered down
// 1: Domain powered up (guaranteed)
#define PRCM_PDSTAT0_PERIPH_ON 0x00000004
#define PRCM_PDSTAT0_PERIPH_ON_BITN 2
#define PRCM_PDSTAT0_PERIPH_ON_M 0x00000004
#define PRCM_PDSTAT0_PERIPH_ON_S 2

// Field:     [1] SERIAL_ON
//
// SERIAL Power domain.
//
// 0: Domain may be powered down
// 1: Domain powered up (guaranteed)
#define PRCM_PDSTAT0_SERIAL_ON 0x00000002
#define PRCM_PDSTAT0_SERIAL_ON_BITN 1
#define PRCM_PDSTAT0_SERIAL_ON_M 0x00000002
#define PRCM_PDSTAT0_SERIAL_ON_S 1

// Field:     [0] RFC_ON
//
// RFC Power domain
//
// 0: Domain may be powered down
// 1: Domain powered up (guaranteed)
#define PRCM_PDSTAT0_RFC_ON 0x00000001
#define PRCM_PDSTAT0_RFC_ON_BITN 0
#define PRCM_PDSTAT0_RFC_ON_M 0x00000001
#define PRCM_PDSTAT0_RFC_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT0RFC
//
//*****************************************************************************
// Field:     [0] ON
//
// Alias for PDSTAT0.RFC_ON
#define PRCM_PDSTAT0RFC_ON 0x00000001
#define PRCM_PDSTAT0RFC_ON_BITN 0
#define PRCM_PDSTAT0RFC_ON_M 0x00000001
#define PRCM_PDSTAT0RFC_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT0SERIAL
//
//*****************************************************************************
// Field:     [0] ON
//
// Alias for PDSTAT0.SERIAL_ON
#define PRCM_PDSTAT0SERIAL_ON 0x00000001
#define PRCM_PDSTAT0SERIAL_ON_BITN 0
#define PRCM_PDSTAT0SERIAL_ON_M 0x00000001
#define PRCM_PDSTAT0SERIAL_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT0PERIPH
//
//*****************************************************************************
// Field:     [0] ON
//
// Alias for PDSTAT0.PERIPH_ON
#define PRCM_PDSTAT0PERIPH_ON 0x00000001
#define PRCM_PDSTAT0PERIPH_ON_BITN 0
#define PRCM_PDSTAT0PERIPH_ON_M 0x00000001
#define PRCM_PDSTAT0PERIPH_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDCTL1
//
//*****************************************************************************
// Field:     [3] VIMS_MODE
//
//
// 0: VIMS power domain is only powered when CPU power domain is powered.
// 1: VIMS power domain is powered whenever the BUS power domain is powered.
#define PRCM_PDCTL1_VIMS_MODE 0x00000008
#define PRCM_PDCTL1_VIMS_MODE_BITN 3
#define PRCM_PDCTL1_VIMS_MODE_M 0x00000008
#define PRCM_PDCTL1_VIMS_MODE_S 3

// Field:     [2] RFC_ON
//
//
// 0: RFC power domain powered off if also PDCTL0.RFC_ON = 0
// 1: RFC power domain powered on
//
// Bit shall be used by RFC in autonomus mode but there is no HW restrictions
// fom system CPU to access the bit.
#define PRCM_PDCTL1_RFC_ON 0x00000004
#define PRCM_PDCTL1_RFC_ON_BITN 2
#define PRCM_PDCTL1_RFC_ON_M 0x00000004
#define PRCM_PDCTL1_RFC_ON_S 2

// Field:     [1] CPU_ON
//
//
// 0: Causes a power down of the CPU power domain when system CPU indicates it
// is idle.
// 1: Initiates power-on of the CPU power domain.
//
// This bit is automatically set by a WIC power-on event.
#define PRCM_PDCTL1_CPU_ON 0x00000002
#define PRCM_PDCTL1_CPU_ON_BITN 1
#define PRCM_PDCTL1_CPU_ON_M 0x00000002
#define PRCM_PDCTL1_CPU_ON_S 1

//*****************************************************************************
//
// Register: PRCM_O_PDCTL1CPU
//
//*****************************************************************************
// Field:     [0] ON
//
// This is an alias for PDCTL1.CPU_ON
#define PRCM_PDCTL1CPU_ON 0x00000001
#define PRCM_PDCTL1CPU_ON_BITN 0
#define PRCM_PDCTL1CPU_ON_M 0x00000001
#define PRCM_PDCTL1CPU_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDCTL1RFC
//
//*****************************************************************************
// Field:     [0] ON
//
// This is an alias for PDCTL1.RFC_ON
#define PRCM_PDCTL1RFC_ON 0x00000001
#define PRCM_PDCTL1RFC_ON_BITN 0
#define PRCM_PDCTL1RFC_ON_M 0x00000001
#define PRCM_PDCTL1RFC_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDCTL1VIMS
//
//*****************************************************************************
// Field:     [0] ON
//
// This is an alias for PDCTL1.VIMS_MODE
#define PRCM_PDCTL1VIMS_ON 0x00000001
#define PRCM_PDCTL1VIMS_ON_BITN 0
#define PRCM_PDCTL1VIMS_ON_M 0x00000001
#define PRCM_PDCTL1VIMS_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1
//
//*****************************************************************************
// Field:     [4] BUS_ON
//
//
// 0: BUS domain not accessible
// 1: BUS domain is currently accessible
#define PRCM_PDSTAT1_BUS_ON 0x00000010
#define PRCM_PDSTAT1_BUS_ON_BITN 4
#define PRCM_PDSTAT1_BUS_ON_M 0x00000010
#define PRCM_PDSTAT1_BUS_ON_S 4

