thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_prcm.h
// Field:     [3] VIMS_MODE
//
//
// 0: VIMS domain not accessible
// 1: VIMS domain is currently accessible
#define PRCM_PDSTAT1_VIMS_MODE 0x00000008
#define PRCM_PDSTAT1_VIMS_MODE_BITN 3
#define PRCM_PDSTAT1_VIMS_MODE_M 0x00000008
#define PRCM_PDSTAT1_VIMS_MODE_S 3

// Field:     [2] RFC_ON
//
//
// 0: RFC domain not accessible
// 1: RFC domain is currently accessible
#define PRCM_PDSTAT1_RFC_ON 0x00000004
#define PRCM_PDSTAT1_RFC_ON_BITN 2
#define PRCM_PDSTAT1_RFC_ON_M 0x00000004
#define PRCM_PDSTAT1_RFC_ON_S 2

// Field:     [1] CPU_ON
//
//
// 0: CPU and BUS domain not accessible
// 1: CPU and BUS domains are both currently accessible
#define PRCM_PDSTAT1_CPU_ON 0x00000002
#define PRCM_PDSTAT1_CPU_ON_BITN 1
#define PRCM_PDSTAT1_CPU_ON_M 0x00000002
#define PRCM_PDSTAT1_CPU_ON_S 1

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1BUS
//
//*****************************************************************************
// Field:     [0] ON
//
// This is an alias for PDSTAT1.BUS_ON
#define PRCM_PDSTAT1BUS_ON 0x00000001
#define PRCM_PDSTAT1BUS_ON_BITN 0
#define PRCM_PDSTAT1BUS_ON_M 0x00000001
#define PRCM_PDSTAT1BUS_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1RFC
//
//*****************************************************************************
// Field:     [0] ON
//
// This is an alias for PDSTAT1.RFC_ON
#define PRCM_PDSTAT1RFC_ON 0x00000001
#define PRCM_PDSTAT1RFC_ON_BITN 0
#define PRCM_PDSTAT1RFC_ON_M 0x00000001
#define PRCM_PDSTAT1RFC_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1CPU
//
//*****************************************************************************
// Field:     [0] ON
//
// This is an alias for PDSTAT1.CPU_ON
#define PRCM_PDSTAT1CPU_ON 0x00000001
#define PRCM_PDSTAT1CPU_ON_BITN 0
#define PRCM_PDSTAT1CPU_ON_M 0x00000001
#define PRCM_PDSTAT1CPU_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_PDSTAT1VIMS
//
//*****************************************************************************
// Field:     [0] ON
//
// This is an alias for PDSTAT1.VIMS_MODE
#define PRCM_PDSTAT1VIMS_ON 0x00000001
#define PRCM_PDSTAT1VIMS_ON_BITN 0
#define PRCM_PDSTAT1VIMS_ON_M 0x00000001
#define PRCM_PDSTAT1VIMS_ON_S 0

//*****************************************************************************
//
// Register: PRCM_O_RFCBITS
//
//*****************************************************************************
// Field:  [31:0] READ
//
// Control bits for RFC. The RF core CPE processor will automatically check
// this register when it boots, and it can be used to immediately instruct CPE
// to perform some tasks at its start-up. The supported functionality is
// ROM-defined and may vary. See the technical reference manual for more
// details.
#define PRCM_RFCBITS_READ_W 32
#define PRCM_RFCBITS_READ_M 0xFFFFFFFF
#define PRCM_RFCBITS_READ_S 0

//*****************************************************************************
//
// Register: PRCM_O_RFCMODESEL
//
//*****************************************************************************
// Field:   [2:0] CURR
//
// Selects the set of commands that the RFC will accept. Only modes permitted
// by RFCMODEHWOPT.AVAIL are writeable. See the technical reference manual for
// details.
// ENUMs:
// MODE7                    Select Mode 7
// MODE6                    Select Mode 6
// MODE5                    Select Mode 5
// MODE4                    Select Mode 4
// MODE3                    Select Mode 3
// MODE2                    Select Mode 2
// MODE1                    Select Mode 1
// MODE0                    Select Mode 0
#define PRCM_RFCMODESEL_CURR_W 3
#define PRCM_RFCMODESEL_CURR_M 0x00000007
#define PRCM_RFCMODESEL_CURR_S 0
#define PRCM_RFCMODESEL_CURR_MODE7 0x00000007
#define PRCM_RFCMODESEL_CURR_MODE6 0x00000006
#define PRCM_RFCMODESEL_CURR_MODE5 0x00000005
#define PRCM_RFCMODESEL_CURR_MODE4 0x00000004
#define PRCM_RFCMODESEL_CURR_MODE3 0x00000003
#define PRCM_RFCMODESEL_CURR_MODE2 0x00000002
#define PRCM_RFCMODESEL_CURR_MODE1 0x00000001
#define PRCM_RFCMODESEL_CURR_MODE0 0x00000000

//*****************************************************************************
//
// Register: PRCM_O_RFCMODEHWOPT
//
//*****************************************************************************
// Field:   [7:0] AVAIL
//
// Permitted RFC modes. More than one mode can be permitted.
// ENUMs:
// MODE7                    Mode 7 permitted
// MODE6                    Mode 6 permitted
// MODE5                    Mode 5 permitted
// MODE4                    Mode 4 permitted
// MODE3                    Mode 3 permitted
// MODE2                    Mode 2 permitted
// MODE1                    Mode 1 permitted
// MODE0                    Mode 0 permitted
#define PRCM_RFCMODEHWOPT_AVAIL_W 8
#define PRCM_RFCMODEHWOPT_AVAIL_M 0x000000FF
#define PRCM_RFCMODEHWOPT_AVAIL_S 0
#define PRCM_RFCMODEHWOPT_AVAIL_MODE7 0x00000080
#define PRCM_RFCMODEHWOPT_AVAIL_MODE6 0x00000040
#define PRCM_RFCMODEHWOPT_AVAIL_MODE5 0x00000020
#define PRCM_RFCMODEHWOPT_AVAIL_MODE4 0x00000010
#define PRCM_RFCMODEHWOPT_AVAIL_MODE3 0x00000008
#define PRCM_RFCMODEHWOPT_AVAIL_MODE2 0x00000004
#define PRCM_RFCMODEHWOPT_AVAIL_MODE1 0x00000002
#define PRCM_RFCMODEHWOPT_AVAIL_MODE0 0x00000001

//*****************************************************************************
//
// Register: PRCM_O_PWRPROFSTAT
//
//*****************************************************************************
// Field:   [7:0] VALUE
//
// SW can use these bits to timestamp the application. These bits are also
// available through the testtap and can thus be used by the emulator to
// profile in real time.
#define PRCM_PWRPROFSTAT_VALUE_W 8
#define PRCM_PWRPROFSTAT_VALUE_M 0x000000FF
#define PRCM_PWRPROFSTAT_VALUE_S 0

//*****************************************************************************
//
// Register: PRCM_O_RAMRETEN
//
//*****************************************************************************
// Field:     [2] RFC
//
//
// 0: Retention for RFC SRAM disabled
// 1: Retention for RFC SRAM enabled
//
// Memories controlled: CPERAM  MCERAM  RFERAM
#define PRCM_RAMRETEN_RFC 0x00000004
#define PRCM_RAMRETEN_RFC_BITN 2
#define PRCM_RAMRETEN_RFC_M 0x00000004
#define PRCM_RAMRETEN_RFC_S 2

// Field:   [1:0] VIMS
//
//
// 0: Memory retention disabled
// 1: Memory retention enabled
//
// Bit 0: VIMS_TRAM
// Bit 1: VIMS_CRAM
//
// Legal modes depend on settings in VIMS:CTL.MODE
//
// 00: VIMS:CTL.MODE must be OFF before DEEPSLEEP is asserted - must be set to
// CACHE or SPLIT mode after waking up again
// 01: VIMS:CTL.MODE must be GPRAM before DEEPSLEEP is asserted. Must remain in
// GPRAM mode after wake up, alternatively select OFF mode first and then CACHE
// or SPILT mode.
// 10: Illegal mode
// 11: No restrictions
#define PRCM_RAMRETEN_VIMS_W 2
#define PRCM_RAMRETEN_VIMS_M 0x00000003
#define PRCM_RAMRETEN_VIMS_S 0

#endif // __PRCM__
